##### After you have obtain the data,it is imp to understand the data .

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('test.csv')

In [3]:
df

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
2,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
3,3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
4,4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

#### Following are the questions that we need to ask, to understand the data

### How big is the data ?

In [13]:
df.shape

(5, 15)

### How does the data looks like ?

In [14]:
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
2,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
3,3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
4,4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

##### If we dont want first 5 rows and want to fetch any 5 random rows we can use sample() and pass on the no of rows that we want .It gives us that no of random rows.Above dataset is pretty small and only contains 5 rows in total ,hence here we can't get to see the effect of this func,but this function is super useful.

In [15]:
df.sample(5)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14
3,3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
4,4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0
1,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
0,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
2,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0

### What is the datatype of cols ?

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   5 non-null      int64
 1   Unnamed: 1   5 non-null      object
 2   Unnamed: 2   5 non-null      object
 3   Unnamed: 3   5 non-null      object
 4   Unnamed: 4   3 non-null      object
 5   Unnamed: 5   5 non-null      object
 6   Unnamed: 6   4 non-null      object
 7   Unnamed: 7   5 non-null      object
 8   Unnamed: 8   5 non-null      object
 9   Unnamed: 9   5 non-null      object
 10  Unnamed: 10  3 non-null      object
 11  Unnamed: 11  4 non-null      object
 12  Unnamed: 12  5 non-null      object
 13  Unnamed: 13  5 non-null      object
 14  Unnamed: 14  5 non-null      object
dtypes: int64(1), object(14)
memory usage: 732.0+ bytes

### Are there any missing values?

##### To know the no of null values in each colum we can use the following code snippet,which gives us series.

In [17]:
df.isnull().sum()

Unnamed: 0     0
Unnamed: 1     0
Unnamed: 2     0
Unnamed: 3     0
Unnamed: 4     2
Unnamed: 5     0
Unnamed: 6     1
Unnamed: 7     0
Unnamed: 8     0
Unnamed: 9     0
Unnamed: 10    2
Unnamed: 11    1
Unnamed: 12    0
Unnamed: 13    0
Unnamed: 14    0
dtype: int64

### How does the data look mathematically?

In [18]:
df.describe()

       Unnamed: 0
count    5.000000
mean     2.000000
std      1.581139
min      0.000000
25%      1.000000
50%      2.000000
75%      3.000000
max      4.000000

##### The describe func only works on the numeric cols.

### Are there any duplicate values?

##### To identify duplicate rows ,we can use duplicated() and then use sum() to count total duplicate rows.

In [19]:
df.duplicated().sum()

0

##### There are no duplicate rows.

### How is the correlation between cols ?

#### To describe the relation among cols ,we use corr() which runs only on numeric cols.It is used to identify which cols are related to output cols.This is process helps us in identifying the cols which are'nt affecting output col and hence we can drop them.

In [21]:
####df.corr()